Merge pull request #3437 from krikera/use-mermaid-diagrams
docs: Convert ASCII diagrams to mermaid
